;------------------------------------------------------------------
; Программа вывода сообщения на экран и ввода строки с клавиатуры
;------------------------------------------------------------------

;------------------- Объявление переменных ----------------
%include 'in_out.asm'
SECTION .data ; Секция инициированных данных
msg: DB 'Введите строку:',10 ; сообщение плюс

                             ; символ перевода строки
msgLen: EQU $-msg            ; Длина переменной 'msg'
SECTION .bss                 ; Секция не инициированных данных
buf1: RESB 80                ; Буфер размером 80 байт

;------------------- Текст программы -----------------
SECTION .text           ; Код программы
GLOBAL _start           ; Начало программы
_start:			; Точка входа в программу

mov eax, msg 
call sprintLF

mov ecx, buf1
mov edx, 80

call sread
call quit

